In [16]:
import numpy as np
import pandas as pd
import lxml
from numpy import nan as NA
data=pd.Series([1,NA,3.5,NA,7])

In [17]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [18]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data.fillna(0)
#data

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [14]:
df = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [26]:
df
#df.dropna()

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df.fillna({1:0,2:1,3:6},axis=0)
df.dropna(how='all')
df[4]=NA
df

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [32]:
df.dropna(how='all') #for all row contain na

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [34]:
df.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [37]:
df1 = pd.DataFrame(np.random.randn(7, 3))
df1.iloc[:4, 1] = NA
df1.iloc[:2, 2] = NA
df1

          0         1         2
0 -0.245498       NaN       NaN
1  0.183821       NaN       NaN
2  0.865194       NaN  1.342601
3  0.957442       NaN -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911

In [43]:
 df1.dropna(thresh=2)  #thresh=1 means rows not contains 1 NA

          0         1         2
2  0.865194       NaN  1.342601
3  0.957442       NaN -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911

In [45]:
df1.fillna(0)
df1.fillna({1:5,2:9})

          0         1         2
0 -0.245498  0.000000  0.000000
1  0.183821  0.000000  0.000000
2  0.865194  0.000000  1.342601
3  0.957442  0.000000 -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911

In [46]:
df1.fillna(method='ffill')

          0         1         2
0 -0.245498       NaN       NaN
1  0.183821       NaN       NaN
2  0.865194       NaN  1.342601
3  0.957442       NaN -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911

In [48]:
df2 = pd.DataFrame(np.random.randn(6, 3))
df2.iloc[2:, 1] = NA
df2.iloc[4:, 2] = NA
df2

          0         1         2
0  0.693127  0.190768 -1.180779
1  0.207396 -1.677154  0.354505
2  0.971215       NaN  0.919825
3  2.128997       NaN  1.856803
4  0.634966       NaN       NaN
5 -0.878642       NaN       NaN

In [51]:
df2.fillna(method='ffill')
df1.fillna(method='bfill')

          0         1         2
0 -0.245498 -0.775569  1.342601
1  0.183821 -0.775569  1.342601
2  0.865194 -0.775569  1.342601
3  0.957442 -0.775569 -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911

In [54]:
print(df2)
print(df2.fillna(method='ffill'))
print(df2.fillna(method='ffill',limit=2))

          0         1         2
0  0.693127  0.190768 -1.180779
1  0.207396 -1.677154  0.354505
2  0.971215       NaN  0.919825
3  2.128997       NaN  1.856803
4  0.634966       NaN       NaN
5 -0.878642       NaN       NaN
          0         1         2
0  0.693127  0.190768 -1.180779
1  0.207396 -1.677154  0.354505
2  0.971215 -1.677154  0.919825
3  2.128997 -1.677154  1.856803
4  0.634966 -1.677154  1.856803
5 -0.878642 -1.677154  1.856803
          0         1         2
0  0.693127  0.190768 -1.180779
1  0.207396 -1.677154  0.354505
2  0.971215 -1.677154  0.919825
3  2.128997 -1.677154  1.856803
4  0.634966       NaN  1.856803
5 -0.878642       NaN  1.856803

In [56]:
print(df1)
print(df1.fillna(method='bfill'))
print(df1.fillna(method='bfill',limit=2))

          0         1         2
0 -0.245498       NaN       NaN
1  0.183821       NaN       NaN
2  0.865194       NaN  1.342601
3  0.957442       NaN -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911
          0         1         2
0 -0.245498 -0.775569  1.342601
1  0.183821 -0.775569  1.342601
2  0.865194 -0.775569  1.342601
3  0.957442 -0.775569 -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911
          0         1         2
0 -0.245498       NaN  1.342601
1  0.183821       NaN  1.342601
2  0.865194 -0.775569  1.342601
3  0.957442 -0.775569 -0.990415
4 -1.957041 -0.775569  0.864845
5 -0.983806  0.003526 -0.476276
6 -0.072244  1.476444  1.259911

In [58]:
df2.fillna (df.mean())

          0         1         2
0  0.693127  0.190768 -1.180779
1  0.207396 -1.677154  0.354505
2  0.971215  6.500000  0.919825
3  2.128997  6.500000  1.856803
4  0.634966  6.500000  3.000000
5 -0.878642  6.500000  3.000000

In [59]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [60]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [68]:
data.duplicated()
data[data.duplicated()]
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [66]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [67]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [73]:
print(data)
data.drop_duplicates(['k1','k2'])
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [83]:
#pg198
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox']
....: ,'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [84]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [85]:
meat_to_animal = {
'bacon': 'peacock',
'pulled pork': 'peacock',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'peacock',
'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'peacock',
 'pulled pork': 'peacock',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'peacock',
 'nova lox': 'salmon'}

In [87]:

lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [88]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces   animal
0        bacon     4.0  peacock
1  pulled pork     3.0  peacock
2        bacon    12.0  peacock
3     Pastrami     6.0      cow
4  corned beef     7.5      cow
5        Bacon     8.0  peacock
6     pastrami     3.0      cow
7    honey ham     5.0  peacock
8     nova lox     6.0   salmon

In [89]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0    peacock
1    peacock
2    peacock
3        cow
4        cow
5    peacock
6        cow
7    peacock
8     salmon
Name: food, dtype: object

In [91]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [96]:
data.replace(-999.,np.nan)
data.replace([-999.,-1000],np.nan)
data.replace([-999.,-1000],[4,6])
data.replace({-999.:4,-1000:8})

0    1.0
1    4.0
2    2.0
3    4.0
4    8.0
5    3.0
dtype: float64

In [98]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [100]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [101]:
data.rename(index=str.lower,columns=str.upper)

          ONE  TWO  THREE  FOUR
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [105]:
data.rename(index={'Ohio':'karachi'},columns={'three':'peshawer'},inplace=True)
data

          one  two  peshawer  four
karachi     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [107]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [109]:
cat=pd.cut(ages,bins)
cat

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [112]:
cat.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [113]:
cat.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [114]:
pd.value_counts(cat)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [131]:
#chp8
#Hierarchical Indexing

data = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -1.756322
   2    1.667037
   3   -0.639654
b  1    0.335008
   3    0.896538
c  1   -0.375019
   2   -1.660059
d  2    0.860055
   3   -1.506378
dtype: float64

In [132]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [137]:
data['a']
data[2]
data['a'],[1]

(1   -1.756322
 2    1.667037
 3   -0.639654
 dtype: float64, [1])

In [141]:
data['b':'c']
data.loc[['b','d']]
data[:,2]

a    1.667037
c   -1.660059
d    0.860055
dtype: float64

In [154]:
da=data.unstack() #convert herical data to table format
da

#data

          1         2         3
a -1.756322  1.667037 -0.639654
b  0.335008       NaN  0.896538
c -0.375019 -1.660059       NaN
d       NaN  0.860055 -1.506378

In [158]:
da[2]

a    1.667037
b         NaN
c   -1.660059
d    0.860055
Name: 2, dtype: float64

In [159]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
....: index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
....: columns=[['Ohio', 'Ohio', 'Colorado'],
....: ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [162]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [164]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [165]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [169]:
frame.sort_index()
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [172]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [178]:
frame.sum()
frame.sum(level=1)
frame.sum(level='key2')

frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10